tiborsimon/embedded-tdd-headers/pic/pic18/pic18f8620_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F8620_H_
#define _PIC18F8620_H_

#define RCSTA2                        0
#define RCD82                         1
#define RX9D2                         2
#define RCSTA2_RCD8                   3
#define RCSTA2_RX9D                   4
#define RCSTA2_OERR                   5
#define OERR2                         6
#define FERR2                         7
#define RCSTA2_FERR                   8
#define RCSTA2_ADEN                   9
#define ADDEN2                        10
#define RCSTA2_ADDEN                  11
#define RCSTA2_CREN                   12
#define CREN2                         13
#define SREN2                         14
#define RCSTA2_SREN                   15
#define RC92                          16
#define RCSTA2_nRC8                   17
#define RCSTA2_RX9                    18
#define RCSTA2_NOT_RC8                19
#define RCSTA2_RC9                    20
#define RC8_92                        21
#define RCSTA2_RC8_9                  22
#define RX92                          23
#define RCSTA2_SPEN                   24
#define SPEN2                         25
#define TXSTA2                        26
#define TXSTA2_TXD8                   27
#define TX9D2                         28
#define TXSTA2_TX9D                   29
#define TXD82                         30
#define TRMT2                         31
#define TXSTA2_TRMT                   32
#define BRGH2                         33
#define TXSTA2_BRGH                   34
#define SENDB2                        35
#define TXSTA2_SYNC                   36
#define SYNC2                         37
#define TXEN2                         38
#define TXSTA2_TXEN                   39
#define TX8_92                        40
#define TX92                          41
#define TXSTA2_TX9                    42
#define TXSTA2_nTX8                   43
#define TXSTA2_NOT_TX8                44
#define TXSTA2_TX8_9                  45
#define TXSTA2_CSRC                   46
#define CSRC2                         47
#define CCP5CON                       48
#define CCP5M0                        49
#define CCP5M                         50
#define CCP5M1                        51
#define CCP5M2                        52
#define CCP5M3                        53
#define DCCP5Y                        54
#define DC5B0                         55
#define DC5B                          56
#define DC5B1                         57
#define DCCP5X                        58
#define CCP4CON                       59
#define CCP4M                         60
#define CCP4M0                        61
#define CCP4M1                        62
#define CCP4M2                        63
#define CCP4M3                        64
#define DCCP4Y                        65
#define DC4B0                         66
#define DC4B                          67
#define DCCP4X                        68
#define DC4B1                         69
#define T4CON                         70
#define T4CKPS0                       71
#define T4CKPS                        72
#define T4CKPS1                       73
#define TMR4ON                        74
#define T4OUTPS                       75
#define T4OUTPS0                      76
#define T4OUTPS1                      77
#define T4OUTPS2                      78
#define T4OUTPS3                      79
#define PORTA                         80
#define AN0                           81
#define PORTA_RA0                     82
#define ULPWUIN                       83
#define AN1                           84
#define PORTA_RA1                     85
#define AN2                           86
#define PORTA_RA2                     87
#define VREFM                         88
#define AN3                           89
#define PORTA_RA3                     90
#define VREFP                         91
#define PORTA_RA4                     92
#define T0CKI                         93
#define AN4                           94
#define PORTA_RA5                     95
#define LVDIN                         96
#define CLKO                          97
#define PORTA_RA6                     98
#define OSC2                          99
#define PORTB                         100
#define INT0                          101
#define PORTB_RB0                     102
#define INT1                          103
#define PORTB_RB1                     104
#define INT2                          105
#define PORTB_RB2                     106
#define INT3                          107
#define CCP2_PA2                      108
#define PORTB_CCP2                    109
#define PORTB_RB3                     110
#define PORTB_CCP2A                   111
#define KBI0                          112
#define PORTB_RB4                     113
#define PGM                           114
#define KBI1                          115
#define PORTB_RB5                     116
#define PGC                           117
#define KBI2                          118
#define PORTB_RB6                     119
#define PGD                           120
#define KBI3                          121
#define PORTB_RB7                     122
#define PORTC                         123
#define T13CKI                        124
#define T1OSO                         125
#define PORTC_RC0                     126
#define PORTC_CCP2A                   127
#define PORTC_CCP2                    128
#define T1OSI                         129
#define PA2                           130
#define PORTC_RC1                     131
#define CCP1                          132
#define PA1                           133
#define PORTC_RC2                     134
#define SCL                           135
#define SCK                           136
#define PORTC_RC3                     137
#define SDA                           138
#define SDI                           139
#define PORTC_RC4                     140
#define SDO                           141
#define PORTC_RC5                     142
#define TX                            143
#define CK                            144
#define PORTC_RC6                     145
#define DT                            146
#define RX                            147
#define PORTC_RC7                     148
#define PORTD                         149
#define PSP0                          150
#define PORTD_RD0                     151
#define AD0                           152
#define AD00                          153
#define PSP1                          154
#define AD01                          155
#define PORTD_RD1                     156
#define AD1                           157
#define AD02                          158
#define PSP2                          159
#define AD2                           160
#define PORTD_RD2                     161
#define AD03                          162
#define PSP3                          163
#define AD3                           164
#define PORTD_RD3                     165
#define PORTD_RD4                     166
#define PSP4                          167
#define AD04                          168
#define AD4                           169
#define PSP5                          170
#define AD05                          171
#define AD5                           172
#define PORTD_RD5                     173
#define PSP6                          174
#define AD06                          175
#define AD6                           176
#define PORTD_RD6                     177
#define SS2                           178
#define PSP7                          179
#define AD07                          180
#define AD7                           181
#define PORTD_RD7                     182
#define PORTE                         183
#define AD08                          184
#define PORTE_RD                      185
#define PD2                           186
#define AD8                           187
#define RDE                           188
#define PORTE_RE0                     189
#define AD09                          190
#define AD9                           191
#define PORTE_WR                      192
#define WRE                           193
#define PORTE_RE1                     194
#define PC2                           195
#define CS                            196
#define CCP10                         197
#define PB2                           198
#define PORTE_RE2                     199
#define AD10                          200
#define PORTE_RE3                     201
#define CCP9E                         202
#define AD11                          203
#define PC3E                          204
#define PORTE_RE4                     205
#define PB3E                          206
#define AD12                          207
#define CCP8E                         208
#define PORTE_RE5                     209
#define CCP7E                         210
#define AD13                          211
#define PC1E                          212
#define CCP6E                         213
#define PORTE_RE6                     214
#define AD14                          215
#define PB1E                          216
#define PORTE_CCP2                    217
#define CCP2E                         218
#define CCP2C                         219
#define PA2E                          220
#define PORTE_RE7                     221
#define AD15                          222
#define PORTF                         223
#define PORTF_RF0                     224
#define AN5                           225
#define PORTF_RF1                     226
#define C2OUTF                        227
#define AN6                           228
#define PORTF_C2OUT                   229
#define PORTF_RF2                     230
#define AN7                           231
#define C1OUTF                        232
#define PORTF_C1OUT                   233
#define PORTF_RF3                     234
#define AN8                           235
#define PORTF_RF4                     236
#define AN9                           237
#define PORTF_RF5                     238
#define PORTF_CVREF                   239
#define AN10                          240
#define PORTF_RF6                     241
#define AN11                          242
#define PORTF_RF7                     243
#define SS                            244
#define PORTG                         245
#define PORTG_RG0                     246
#define CCP3                          247
#define TX2                           248
#define PORTG_RG1                     249
#define C3OUTG                        250
#define CK2                           251
#define PORTG_RG2                     252
#define DT2                           253
#define RX2                           254
#define PORTG_RG3                     255
#define CCP4                          256
#define PORTG_RG4                     257
#define CCP5                          258
#define PORTH                         259
#define PORTH_RH0                     260
#define A16                           261
#define AD16                          262
#define PORTH_RH1                     263
#define A17                           264
#define AD17                          265
#define PORTH_RH2                     266
#define A18                           267
#define AD18                          268
#define PORTH_RH3                     269
#define A19                           270
#define AD19                          271
#define PORTH_RH4                     272
#define CCP9                          273
#define PC3                           274
#define AN12                          275
#define PORTH_RH5                     276
#define CCP8                          277
#define PB3                           278
#define AN13                          279
#define PORTH_RH6                     280
#define CCP7                          281
#define PC1                           282
#define AN14                          283
#define PORTH_RH7                     284
#define CCP6                          285
#define PB1                           286
#define AN15                          287
#define PORTJ                         288
#define ALE                           289
#define PORTJ_RJ0                     290
#define OE                            291
#define PORTJ_RJ1                     292
#define WRL                           293
#define PORTJ_RJ2                     294
#define WRH                           295
#define PORTJ_RJ3                     296
#define BA0                           297
#define PORTJ_RJ4                     298
#define CE                            299
#define PORTJ_RJ5                     300
#define LB                            301
#define PORTJ_RJ6                     302
#define PORTJ_RJ7                     303
#define UB                            304
#define LATA                          305
#define LATA0                         306
#define LA0                           307
#define LATA1                         308
#define LA1                           309
#define LATA2                         310
#define LA2                           311
#define LATA3                         312
#define LA3                           313
#define LATA4                         314
#define LA4                           315
#define LATA5                         316
#define LA5                           317
#define LATA6                         318
#define LA6                           319
#define LATB                          320
#define LB0                           321
#define LATB0                         322
#define LB1                           323
#define LATB1                         324
#define LB2                           325
#define LATB2                         326
#define LB3                           327
#define LATB3                         328
#define LB4                           329
#define LATB4                         330
#define LB5                           331
#define LATB5                         332
#define LB6                           333
#define LATB6                         334
#define LB7                           335
#define LATB7                         336
#define LATC                          337
#define LATC0                         338
#define LC0                           339
#define LATC1                         340
#define LC1                           341
#define LATC2                         342
#define LC2                           343
#define LATC3                         344
#define LC3                           345
#define LATC4                         346
#define LC4                           347
#define LATC5                         348
#define LC5                           349
#define LATC6                         350
#define LC6                           351
#define LATC7                         352
#define LC7                           353
#define LATD                          354
#define LATD0                         355
#define LD0                           356
#define LATD1                         357
#define LD1                           358
#define LATD2                         359
#define LD2                           360
#define LATD3                         361
#define LD3                           362
#define LATD4                         363
#define LD4                           364
#define LATD5                         365
#define LD5                           366
#define LATD6                         367
#define LD6                           368
#define LATD7                         369
#define LD7                           370
#define LATE                          371
#define LATE0                         372
#define LE0                           373
#define LATE1                         374
#define LE1                           375
#define LATE2                         376
#define LE2                           377
#define LATE3                         378
#define LE3                           379
#define LATE4                         380
#define LE4                           381
#define LATE5                         382
#define LE5                           383
#define LATE6                         384
#define LE6                           385
#define LATE7                         386
#define LE7                           387
#define LATF                          388
#define LATF0                         389
#define LF0                           390
#define LATF1                         391
#define LF1                           392
#define LF2                           393
#define LATF2                         394
#define LF3                           395
#define LATF3                         396
#define LF4                           397
#define LATF4                         398
#define LF5                           399
#define LATF5                         400
#define LF6                           401
#define LATF6                         402
#define LF7                           403
#define LATF7                         404
#define LATG                          405
#define LATG0                         406
#define LG0                           407
#define LATG1                         408
#define LG1                           409
#define LATG2                         410
#define LG2                           411
#define LATG3                         412
#define LG3                           413
#define LATG4                         414
#define LG4                           415
#define LATH                          416
#define LH0                           417
#define LATH0                         418
#define LH1                           419
#define LATH1                         420
#define LH2                           421
#define LATH2                         422
#define LH3                           423
#define LATH3                         424
#define LH4                           425
#define LATH4                         426
#define LH5                           427
#define LATH5                         428
#define LH6                           429
#define LATH6                         430
#define LH7                           431
#define LATH7                         432
#define LATJ                          433
#define LATJ0                         434
#define LJ0                           435
#define LATJ1                         436
#define LJ1                           437
#define LATJ2                         438
#define LJ2                           439
#define LATJ3                         440
#define LJ3                           441
#define LATJ4                         442
#define LJ4                           443
#define LATJ5                         444
#define LJ5                           445
#define LATJ6                         446
#define LJ6                           447
#define LATJ7                         448
#define LJ7                           449
#define TRISA                         450
#define TRISA_RA0                     451
#define TRISA0                        452
#define TRISA_RA1                     453
#define TRISA1                        454
#define TRISA2                        455
#define TRISA_RA2                     456
#define TRISA_RA3                     457
#define TRISA3                        458
#define TRISA_RA4                     459
#define TRISA4                        460
#define TRISA_RA5                     461
#define TRISA5                        462
#define TRISA_RA6                     463
#define TRISA6                        464
#define TRISB                         465
#define TRISB_RB0                     466
#define TRISB0                        467
#define TRISB_RB1                     468
#define TRISB1                        469
#define TRISB_RB2                     470
#define TRISB2                        471
#define TRISB_RB3                     472
#define TRISB3                        473
#define TRISB_RB4                     474
#define TRISB4                        475
#define TRISB_RB5                     476
#define TRISB5                        477
#define TRISB_RB6                     478
#define TRISB6                        479
#define TRISB_RB7                     480
#define TRISB7                        481
#define TRISC                         482
#define TRISC0                        483
#define TRISC_RC0                     484
#define TRISC1                        485
#define TRISC_RC1                     486
#define TRISC2                        487
#define TRISC_RC2                     488
#define TRISC3                        489
#define TRISC_RC3                     490
#define TRISC4                        491
#define TRISC_RC4                     492
#define TRISC5                        493
#define TRISC_RC5                     494
#define TRISC6                        495
#define TRISC_RC6                     496
#define TRISC7                        497
#define TRISC_RC7                     498
#define TRISD                         499
#define TRISD_RD0                     500
#define TRISD0                        501
#define TRISD_RD1                     502
#define TRISD1                        503
#define TRISD_RD2                     504
#define TRISD2                        505
#define TRISD_RD3                     506
#define TRISD3                        507
#define TRISD_RD4                     508
#define TRISD4                        509
#define TRISD_RD5                     510
#define TRISD5                        511
#define TRISD_RD6                     512
#define TRISD6                        513
#define TRISD_RD7                     514
#define TRISD7                        515
#define TRISE                         516
#define TRISE_RE0                     517
#define TRISE0                        518
#define TRISE1                        519
#define TRISE_RE1                     520
#define TRISE2                        521
